{
    "title": "Professional experience",
    "experiences": [
      {
        "company": "Navro",
        "logo": "/media/navro-logo.png",
        "description": "Navro simplifies global payments for businesses by offering access to premier payment services worldwide through a single contract and API.",
        "website": "https://navro.com",
        "websiteLabel": "navro.com",
        "roleDescription": "Joined as the first in-house designer and transitioned the design function from a consultancy model to a permanent team, establishing foundational processes and adopting research methodologies for continuous discovery. Collaborating closely with Product and Engineering leadership, I helped deliver a full payments suite with complex workflows that comply with regulatory requirements across various regions, contributing to the company's growth from pre-seed to securing Series A investment.",
        "role": "Product Designer",
        "date": "2023 - today"
      },
      {
        "company": "Swell Commerce",
        "logo": "/media/swell-logo.png",
        "description": "Swell is a customizable, API-first e-commerce platform. It's headless architecture offers businesses the flexibility to operate multiple storefronts across various tech stacks.",
        "website": "https://www.swell.is",
        "websiteLabel": "swell.is",
        "roleDescription": "I embraced a new challenge as a Product Manager, applying my e-commerce and product design expertise to develop a hosted storefronts solution featuring a no-code builder - a product aiming to unlock the full potential of the SMB customer segment for the business. I also contributed to increased conversions through the optimisation of the product onboarding.",
        "role": "Product Manager",
        "date": "2022"
      },
      {
        "company": "Gaspard+Bruno",
        "logo": "/media/gaspardbruno-logo.png",
        "description": "Gaspard+Bruno is an independent creative company with offices in London and Lisbon, specializing in strategy, design, and engineering.",
        "website": "https://gaspardbruno.com",
        "websiteLabel": "gaspardbruno.com",
        "roleDescription": "I helped shaping their product approach and played a key role in collaborations with high-profile clients such as Public.com, Off-White, and Browns Fashion (for Farfetch), helping transform the organisation from a small studio into the creative powerhouse it is today.",
        "role": "Product Designer → Team Lead",
        "date": "2017 - 2022"
      }
    ]
  }